{
  "entity_model_features.title": "Características del modelo de entidad",
  "entity_model_features.config.general": "General",
  "entity_model_features.config.general.tooltip": "Configuraciones generales",
  "entity_model_features.config.substitute_vanilla": "Sustituir partes de modelo faltantes",
  "entity_model_features.config.substitute_vanilla.tooltip": "EMF intentará reemplazar las partes faltantes en el archivo de modelo .jem con las partes de modelo de vainilla",
  "entity_model_features.config.optimizations": "Optimización",
  "entity_model_features.config.optimizations.tooltip": "Configuraciones relacionadas con la optimización de animaciones",
  "entity_model_features.config.debug": "Depuración",
  "entity_model_features.config.debug.tooltip": "Opciones de depuración, pueden ser útiles para resolver problemas",
  "entity_model_features.config.log_models": "Registrar información de construcción de modelos",
  "entity_model_features.config.log_models.tooltip": "Imprime datos de depuración sobre la creación de modelos en el registro",
  "entity_model_features.config.vanilla_render.normal": "normal",
  "entity_model_features.config.vanilla_render.offset": "desplazamiento",
  "entity_model_features.config.vanilla_render": "Modo de visualización del modelo de vainilla",
  "entity_model_features.config.vanilla_render.tooltip": "Esta configuración mostrará el modelo de vainilla junto con el personalizado para compararlos. No se animará y puede estar posicionado de forma extraña",
  "entity_model_features.config.log_math": "Registrar cálculos de animación",
  "entity_model_features.config.log_math.tooltip": "Imprime datos de depuración sobre los cálculos de animación en el registro. ¡ADVERTENCIA! ¡PUEDE CAUSAR MUCHA LENTITUD!",
  "entity_model_features.config.options": "Opciones y correcciones",
  "entity_model_features.config.options.tooltip": "Varias opciones para características fundamentales o correcciones de compatibilidad con mods",
  "entity_model_features.config.tools": "Herramientas",
  "entity_model_features.config.tools.tooltip": "Herramientas opcionales para ayudar con la creación de modelos o distinguir modelos personalizados",
  "entity_model_features.config.force_models": "Intentar evitar que los modelos de EMF sean reemplazados",
  "entity_model_features.config.force_models.tooltip": "Intentará forzar a los renderizadores de entidades a usar los modelos establecidos por EMF. Esto puede reemplazar los modelos de vainilla modificados por otros mods. No funcionará con todos los mods",
  "entity_model_features.config.print_mode.log": "Modelos desconocidos: solo registro",
  "entity_model_features.config.print_mode.log_jem": "Modelos desconocidos: registro y .jem",
  "entity_model_features.config.print_mode.all_log": "Todos los modelos: solo registro",
  "entity_model_features.config.print_mode.all_log_jem": "Todos los modelos: registro y .jem",
  "entity_model_features.config.print_mode.tooltip": "Esto imprimirá la información de las partes o un archivo .jem completo para cualquier modelo al que EMF pueda acceder. Los archivos .jem se pueden encontrar en \"MC_DIRECTORY/emf/export\" después de recargar. Los archivos .jem están listos para Blockbench con pivotes, cajas y UV correctos. Los modelos desconocidos se refieren a modelos no compatibles con OptiFine CEM",
  "entity_model_features.config.print_mode": "Exportación de modelos",
  "entity_model_features.config.physics": "Parche de mod de física",
  "entity_model_features.config.physics.tooltip": "Solo renderizará las partes originales del modelo de vainilla al morir si el mod de física está habilitado. Esto funciona parcialmente pero no es una solución perfecta",
  "entity_model_features.config.update": "Frecuencia de actualización del modelo",
  "entity_model_features.config.update.tooltip": "Establece con qué frecuencia se actualizará el modelo de una entidad para cambios como la salud y la edad. Nunca = nunca se actualiza. Lento = 3-5 segundos. Promedio = aproximadamente 1 segundo. Rápido = menos de un segundo. Instantáneo = instantáneo (posible lentitud con cientos de entidades)",
  "entity_model_features.config.texture_override_mode.emf": "Intentar con código de EMF",
  "entity_model_features.config.texture_override_mode.dont": "Ignorar reemplazos de textura",
  "entity_model_features.config.texture_override_mode.iris": "Intentar con Iris primero",
  "entity_model_features.config.texture_override_mode.tooltip": "Esto controla cómo EMF maneja la representación de submodelos que tienen una textura de reemplazo establecida, por ejemplo, si un modelo de creeper tiene una textura separada para la cabeza del submodelo. Hay dos formas de hacer esto, confiar en mi código o confiar en una peculiaridad del mod Iris. Mi código 'funciona', pero no soy un experto en búferes de representación y puede causar problemas. La opción de Iris utilizará el código de EMF de forma predeterminada si Iris no está instalado. Esto casi siempre debe dejarse en su valor predeterminado, excepto cuando se depuran las sustituciones de textura en submodelos",
  "entity_model_features.config.texture_override_mode": "Manejo de texturas de submodelo",
  "entity_model_features.config.physics.1": "Usar modelo vanilla",
  "entity_model_features.config.physics.2": "Usar modelo EMF (CEM)",
  "entity_model_features.config.debug_right_click": "Mostrar datos de depuración de EMF al hacer clic derecho en la entidad",
  "entity_model_features.config.debug_right_click.tooltip": "Si está habilitado, esto imprimirá información de depuración de EMF en el registro y en el chat cuando se haga clic derecho en una entidad.",
  "entity_model_features.config.lod": "Distancia de LOD de animación",
  "entity_model_features.config.lod.tooltip": "Establece la distancia a la cual las animaciones comenzarán a omitir fotogramas, reducir el Nivel de Detalle (LOD). Esto puede ayudar con el rendimiento. Ninguno = no se omiten fotogramas. 16 = se omitirá 1 fotograma por cada 16 bloques de distancia del jugador. Números más bajos significan más fotogramas omitidos y más ganancia de rendimiento, pero las animaciones se volverán más notablemente más lentas cuanto más cerca esté la distancia LOD.",
  "entity_model_features.config.low_fps_lod": "Mantener LOD con baja velocidad de fotogramas",
  "entity_model_features.config.low_fps_lod.tooltip": "Si está habilitado, esto reducirá el impacto del Nivel de Detalle (LOD) según la velocidad de fotogramas. Solo se aplica cuando está por debajo de 60 fps, ya que los fotogramas omitidos se vuelven cada vez más notorios a velocidades de fotogramas más bajas.",
  "entity_model_features.config.render.normal": "Normal",
  "entity_model_features.config.render.green": "Destello verde",
  "entity_model_features.config.render.lines": "Solo alambre",
  "entity_model_features.config.render.lines_texture": "Alambre sobre textura",
  "entity_model_features.config.render.lines_texture_flash": "Destello de alambre sobre textura",
  "entity_model_features.config.render.none": "Desactivado",
  "entity_model_features.config.render": "Modo de renderizado de EMF",
  "entity_model_features.config.render.tooltip": "Cambia cómo se renderizan las partes del modelo personalizado, esto no afecta las partes del modelo de vainilla. Normal = renderizado normal. Destello verde = las partes personalizadas destellarán en verde. Contornos = se renderizarán los contornos de las partes del modelo. Desactivado = las partes del modelo personalizado no se renderizarán",
  "entity_model_features.config.animate_once": "Animar modelos solo una vez por entidad",
  "entity_model_features.config.animate_once.tooltip": "Activado de forma predeterminada, esta configuración hace que los modelos de entidad se animen solo una vez por cada entidad renderizada. Esto será completamente normal en el juego, sin embargo, las criaturas visibles en las pantallas de inventario pueden parpadear de manera extraña, especialmente si representa una criatura real en el mundo que ya puedes ver.",
  "entity_model_features.config.ebe_config_modify": "Parche del mod Enhanced Block Entities (EBE)",
  "entity_model_features.config.ebe_config_modify.tooltip": "Si está habilitado, esto permitirá que EMF modifique la configuración del mod EBE para desactivar EBE para ciertas entidades de bloque si ese bloque realmente tiene un modelo EMF personalizado cargado. EMF no puede volver a habilitar automáticamente estas configuraciones, deberás hacerlo manualmente si lo deseas."
}
